src/docs/dependencies.dot
digraph dependencies {
  quest -> {slam primal mint spin};
  quest -> {klee sidre} [style="dashed"];
  {inlet klee mint primal quest slam spin sidre} -> {slic core};
  mint -> slam
  mint -> sidre [style="dashed"];
  mir -> {bump slic core slam primal};
  multimat -> {slic slam};
  spin -> {slam primal};
  sina -> {core};
  slic -> core;
  slic -> lumberjack [style="dashed"];
  lumberjack -> core;
  inlet -> {sidre primal};
  klee -> {sidre primal inlet};
  bump -> {core slic spin primal};
}
